
//If30.Дано целое число, лежащее в диапазоне 1–999.Вывести его строку -
//описание вида «четное двузначное число», «нечетное трехзначное число»
//и т.д.

#include "If_main.h"

void if4()
{
	int x = 0;

	cout << "Ведiть X" << endl;
	cin >> x;

	if (1 > x or x > 999)
	{
		cout << "Ввели не коректнi данi!" << endl;

		return;
	}

	if (x > 99 and x % 2 == 0) cout << "Трьохзначне парне число" << endl;
	else if (x > 99) cout << "Трьохзначне не парне число" << endl;
	else if (x > 9 and x % 2 == 0) cout << "Двохзначне парне число" << endl;
	else if (x > 9) cout << "Двохзначне не парне число" << endl;
	else if (x % 2 == 0) cout << "Однозначне парне число" << endl;
	else cout << "Однозначне не парне число" << endl;
}